#### FormulaManager Members

---

|  |
| --- |
| FormulaManager Class   Methods   Properties   See Also |

The  FormulaManager  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  FormulaManager |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method Static member | Evaluate | Evaluates value of the formula |
| Public method Static member | GetFunctions | Gets list of function names supported by formula engine |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method Static member | GetOperators | Gets list of operator names supported by formula engine |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |
| Public method Static member | Validate | Validates the formuls |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

FormulaManager Class

Autodesk.Revit.DB Namespace